/**
 * В заголовочном файле определить класс «Матрица» с закрытыми полями N – количество строк, M –
 * количество столбцов и двумерным вещественным динамическим массивом N x M.
 * Реализовать конструктор по умолчанию и деструктор. Перегрузить операторы "==" (сравнение с
 * матрицей), "~" (унарный, транспонирование матрицы) и реализовать метод "trace" (след матрицы).
 * Определения методов поместить в отдельную единицу трансляции.
 * Оформить в виде статической библиотеки. Создать исполняемый модуль, тестирующий корректность
 * работы реализованных методов.
 */

int main(int argc, char *argv[])
{
    return 0;
}
